Unictron-Devin/TUYA_ESP32C6/sdkconfig.defaults
# Chip Selection
CONFIG_IDF_TARGET="esp32c6"

# Enable common components
CONFIG_FREERTOS_UNICORE=y

# WiFi Configuration (optional)
# CONFIG_ESP_WIFI_SSID="YOUR_SSID"
# CONFIG_ESP_WIFI_PASSWORD="YOUR_PASSWORD"

# BLE Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y

# Partition Scheme - Use default scheme instead of custom
# CONFIG_PARTITION_TABLE_CUSTOM is not set

# Flash Settings
CONFIG_SPI_FLASH_FREQ_80M=y

# Memory
CONFIG_ESP32C6_INSTRUCTION_CACHE_SIZE=16
CONFIG_ESP32C6_INSTRUCTION_CACHE_ASSOCIATED_BANKS=1
CONFIG_ESP32C6_DATA_CACHE_SIZE=16
CONFIG_ESP32C6_DATA_CACHE_ASSOCIATED_BANKS=1

# Logging
CONFIG_LOG_DEFAULT_LEVEL=3

# Optional: Component Configuration
# CONFIG_COMPONENT_REQUIRES_COMMON_HEADERS=y
